In [1]:
import pandas as pd

In [15]:
data = pd.read_csv('D:/College-material/Studentdata.csv')
data

       Name   Roll NO.   Marks Class   City
0    Jayesh          28     90     B    Pune
1  Saidatta          43     97     A  Satara
2     Prasad         77    100     C  Indore
3    Krishna         44     85     B  Satara
4   Shridhar         31     88     B    Pune
5    Rajdeep         48     66     A  Satara
6      varun         30     44     C  Indore
7      Rohan         37     85     D  Satara
8   Bhushan          27     55     A  Indore
9    Atharva          1     99     B    Pune

In [16]:
data.head()

       Name   Roll NO.   Marks Class   City
0    Jayesh          28     90     B    Pune
1  Saidatta          43     97     A  Satara
2     Prasad         77    100     C  Indore
3    Krishna         44     85     B  Satara
4   Shridhar         31     88     B    Pune

In [18]:
data.tail()

      Name   Roll NO.   Marks Class   City
5   Rajdeep         48     66     A  Satara
6     varun         30     44     C  Indore
7     Rohan         37     85     D  Satara
8  Bhushan          27     55     A  Indore
9   Atharva          1     99     B    Pune

In [19]:
data.describe()

       Roll NO.        Marks
count  10.000000   10.000000
mean   36.600000   80.900000
std    19.340229   19.358891
min     1.000000   44.000000
25%    28.500000   70.750000
50%    34.000000   86.500000
75%    43.750000   95.250000
max    77.000000  100.000000

In [20]:
data.columns

Index(['Name ', 'Roll NO. ', 'Marks', 'Class', 'City '], dtype='object')

In [21]:
data.size

50

In [27]:
data.shape
data.shape[0]

10

In [28]:
data.values

array([['Jayesh ', 28, 90, 'B', 'Pune'],
       ['Saidatta ', 43, 97, 'A', 'Satara'],
       ['Prasad', 77, 100, 'C', 'Indore'],
       ['Krishna', 44, 85, 'B', 'Satara'],
       ['Shridhar', 31, 88, 'B', 'Pune'],
       ['Rajdeep', 48, 66, 'A', 'Satara'],
       ['varun', 30, 44, 'C', 'Indore'],
       ['Rohan', 37, 85, 'D', 'Satara'],
       ['Bhushan ', 27, 55, 'A', 'Indore'],
       ['Atharva', 1, 99, 'B', 'Pune']], dtype=object)

In [29]:
data['Name ']

0      Jayesh
1    Saidatta
2       Prasad
3      Krishna
4     Shridhar
5      Rajdeep
6        varun
7        Rohan
8     Bhushan
9      Atharva
Name: Name , dtype: object